In [75]:
import pandas as pd

from sklearn import datasets

In [76]:
data = datasets.load_iris()

In [77]:
data.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [78]:
df_iris = pd.DataFrame(data.data, columns=data.feature_names)

In [79]:
df_iris.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [80]:
df_iris['species'] = data.target

In [81]:
data.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [82]:
df_iris.describe(percentiles=[0.85, 0.95, 0.99])

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
count,150.000000,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333,1.000000
std,0.828066,0.435866,1.765298,0.762238,0.819232
min,4.300000,2.000000,1.000000,0.100000,0.000000
50%,5.800000,3.000000,4.350000,1.300000,1.000000
85%,6.700000,3.500000,5.600000,2.065000,2.000000
95%,7.255000,3.800000,6.100000,2.300000,2.000000
99%,7.700000,4.151000,6.700000,2.500000,2.000000
max,7.900000,4.400000,6.900000,2.500000,2.000000

In [83]:
df_iris['species'].unique()

array([0, 1, 2])

In [84]:
df_iris['species'].value_counts(normalize= True)

0    0.333333
1    0.333333
2    0.333333
Name: species, dtype: float64

#### iris data visualization [https://chart-studio.plotly.com/~jhl267/2/iris-dataset/#/]

In [85]:
df_iris.columns = df_iris.columns.str.replace(' ', '_')

In [86]:
df_iris.head()

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0

In [87]:
df_iris['species'] = df_iris['species'].map({0:'setosa', 1:'versicolor', 2:'virginica'})

In [125]:
df_datetime = pd.read_csv('../data/Axum_clean_cont_Hist_combined.csv')

In [126]:
df_datetime.head()

          timestampUTC  measured_kW
0  2014-09-07 00:00:00       194.88
1  2014-09-07 00:15:00       190.56
2  2014-09-07 00:30:00       193.44
3  2014-09-07 00:45:00       192.96
4  2014-09-07 01:00:00       190.56

In [127]:
df_datetime.shape

(103488, 2)

In [128]:
df_datetime.dtypes

timestampUTC     object
measured_kW     float64
dtype: object

In [129]:
df_datetime['timestampUTC'] = pd.to_datetime(df_datetime['timestampUTC'])

In [130]:
df_datetime['timestampUTC'].min(), df_datetime['timestampUTC'].max()

(Timestamp('2014-09-07 00:00:00'), Timestamp('2017-08-19 23:45:00'))

In [131]:
# converting the data into index and resetting index

df_datetime.set_index('timestampUTC', inplace=True)

In [119]:
df_datetime.shape

(103488, 1)

In [123]:
df_datetime.reset_index().head(2)

          timestampUTC  measured_kW
0  2014-09-07 00:00:00       194.88
1  2014-09-07 00:15:00       190.56

In [95]:
df_trip = pd.read_csv('../data/timeseries.csv')

In [96]:
df_trip.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee
0,2,2022-01-17 18:45:09,2022-01-17 18:48:15,1.0,0.55,1.0,N,237,141,1,4.5,0.0,0.5,1.95,0.0,0.3,9.75,2.5,0.00
1,1,2022-01-20 20:15:33,2022-01-20 20:27:54,NaN,2.20,NaN,NaN,161,113,0,10.5,0.5,0.5,2.15,0.0,0.3,16.45,NaN,NaN
2,1,2022-01-28 19:09:40,2022-01-28 19:19:02,3.0,1.50,1.0,N,236,162,1,9.0,3.5,0.5,2.65,0.0,0.3,15.95,2.5,0.00
3,1,2022-01-17 09:34:17,2022-01-17 09:44:04,1.0,1.20,1.0,N,170,186,1,8.0,2.5,0.5,2.26,0.0,0.3,13.56,2.5,0.00
4,2,2022-01-08 02:18:23,2022-01-08 02:55:13,1.0,22.45,1.0,N,132,97,2,61.0,0.5,0.5,0.00,0.0,0.3,63.55,0.0,1.25

In [100]:
df_trip['tpep_pickup_datetime'] = pd.to_datetime(df_trip['tpep_pickup_datetime'])
df_trip['tpep_dropoff_datetime'] = pd.to_datetime(df_trip['tpep_dropoff_datetime'])

In [102]:
df_trip['duration']   = df_trip['tpep_dropoff_datetime'] - df_trip['tpep_pickup_datetime']

In [105]:
df_trip['duration'] = df_trip['duration'].dt.total_seconds()

In [106]:
df_trip.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee,duration
0,2,2022-01-17 18:45:09,2022-01-17 18:48:15,1.0,0.55,1.0,N,237,141,1,4.5,0.0,0.5,1.95,0.0,0.3,9.75,2.5,0.00,186.0
1,1,2022-01-20 20:15:33,2022-01-20 20:27:54,NaN,2.20,NaN,NaN,161,113,0,10.5,0.5,0.5,2.15,0.0,0.3,16.45,NaN,NaN,741.0
2,1,2022-01-28 19:09:40,2022-01-28 19:19:02,3.0,1.50,1.0,N,236,162,1,9.0,3.5,0.5,2.65,0.0,0.3,15.95,2.5,0.00,562.0
3,1,2022-01-17 09:34:17,2022-01-17 09:44:04,1.0,1.20,1.0,N,170,186,1,8.0,2.5,0.5,2.26,0.0,0.3,13.56,2.5,0.00,587.0
4,2,2022-01-08 02:18:23,2022-01-08 02:55:13,1.0,22.45,1.0,N,132,97,2,61.0,0.5,0.5,0.00,0.0,0.3,63.55,0.0,1.25,2210.0

In [98]:
# write out any dataset
# df_trip.to_csv('../data/delete.csv', index=False)

In [136]:
# sorting by index/labels vs sorting by values

df_datetime.sort_index(ascending = False).head(2)

                     measured_kW
timestampUTC
2017-08-19 23:45:00       295.68
2017-08-19 23:30:00       295.68

In [139]:
df_datetime.sort_values(by= ['measured_kW'], ascending = False).head(2)

                     measured_kW
timestampUTC
2015-08-15 22:00:00       415.68
2015-08-15 23:30:00       413.76

In [143]:
df_iris.sort_values(by = ['sepal_length_(cm)', 'petal_length_(cm)']).head(2)

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm),species
13,4.3,3.0,1.1,0.1,setosa
38,4.4,3.0,1.3,0.2,setosa

In [145]:
#correlation

df_iris.corr()

C:\Users\butt_\AppData\Local\Temp\ipykernel_12592\120115371.py:3: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_iris.corr()

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm)
sepal_length_(cm),1.000000,-0.117570,0.871754,0.817941
sepal_width_(cm),-0.117570,1.000000,-0.428440,-0.366126
petal_length_(cm),0.871754,-0.428440,1.000000,0.962865
petal_width_(cm),0.817941,-0.366126,0.962865,1.000000

In [147]:
# another way to subset the columns

df_iris[['sepal_length_(cm)', 'petal_width_(cm)']].head()

   sepal_length_(cm)  petal_width_(cm)
0                5.1               0.2
1                4.9               0.2
2                4.7               0.2
3                4.6               0.2
4                5.0               0.2